Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བཅོམ་ལྡན་འདས་ཀྱི་ཡེ་ཤེས་རྒྱས་པའི་མདོ་སྡེ་རིན་པོ་ཆེ་མཐའ་ཡས་པ་མཐར་ཕྱིན་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Precious Discourse on the Blessed One’s Extensive Wisdom That Leads to Infinite Certainty

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: The Blessed One was staying in Jeta Grove, Anāthapiṇḍada’s park at Śrāvastī, along with a great saṅgha of 1,250 monks.

source: དེའི་ཚེ་གྲོང་ཁྱེར་ཆེན་པོ་དགེ་བའི་ཕ་རོལ་འགྲོ་ཞེས་བྱ་བར་ཁྱིམ་བདག་ཕྱྭ་མཁན་ཞིག་གིས་བཅོམ་ལྡན་འདས་ཁོ་ནའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཁོ་ན་ལ་དམིགས་ཏེ།
en: At that time, in the city of Transcending Virtue there was a householder, a master builder, [who had engaged venerable Pūrṇa to oversee the construction of a temple with a sandalwood courtyard] exclusively dedicated to the Blessed One, exclusively with the Blessed One in mind,

source: བཅོམ་ལྡན་འདས་ཁོ་ནའི་ཆེད་དུ་ཚེ་དང་ལྡན་པ་གང་པོ་ལག་གི་བླ་བྱེད་དུ་བཅུག་ནས།
en: who had engaged venerable Pūrṇa to oversee the construction [of a temple with a sandalwood courtyard exclusively dedicated to the Blessed One, exclusively with the Blessed One in mind,] and exclusively for the sake of the Blessed One.

source: ཁང་བཟངས་ཙན་དན་གྱི་ཁྱམས་དང་ལྡན་པ་ཞིག་རིང་པོར་མ་ཐོགས་པར་བྱས་ཏེ།
en: Subsequently, that temple with its sandalwood courtyard had been constructed and

source: རིང་པོར་མ་ཐོགས་པར་ཟིན་ནོ། །
en: completed without delay.

source: དེ་ནས་ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་ཚེ་དང་ལྡན་པ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: At that point, the householder master builder said to venerable Pūrṇa,

source: གང་པོ་ཁང་བཟངས་ཙན་དན་གྱི་ཁྱམས་དང་ལྡན་པ་འདི་ནི་བཅོམ་ལྡན་འདས་ཁོ་ནའི་ཕྱིར་བྱས།
en: “Pūrṇa, although this temple has been made exclusively for the Blessed One,

source: བཅོམ་ལྡན་འདས་ཁོ་ན་ལ་དམིགས་ཏེ།
en: exclusively with the Blessed One in mind, and

source: བཅོམ་ལྡན་འདས་ཀྱི་ཆེད་དུ་བྱས་པ་ཡིན་ན།
en: exclusively for the sake of the Blessed One,

source: གཞན་སུ་ཞིག་ཁང་བཟངས་ཙན་དན་གྱི་ཁྱམས་དང་ལྡན་པ་འདི་ལོངས་སྤྱོད་པར་བྱེད་ཀྱིས།
en: we should also let others use it.

source: ཅི་ནས་བདག་གི་སྦྱིན་པ་འདི་འབྲས་བུ་ཆེ་བར་འགྱུར་བ་དང་། ཅི་ནས་བདག་གི་འབད་པ་འདི་དོན་ཡོད་པར་འགྱུར་བ་དང་། ཅི་ནས་བདག་གི་སྦྱིན་པ་འདི་ལོངས་སྤྱོད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་སྦྱིན་པ་འདི་བཏང་བ་དང་། ལོངས་སྤྱོད་ན་ཤིན་ཏུ་དགའ་བ་དང་། རབ་ཏུ་དགའ་བ་མང་བར་འགྱུར་རོ། །
en: In that way this gift of mine will have a greater effect and my efforts will be meaningful. My gift must be put to good use. If I offer this temple and it is used, it will make me very happy.”

source: ལག་གི་བླ་ཚེ་དང་ལྡན་པ་གང་པོས་ཁྱིམ་བདག་ཕྱྭ་མཁན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Venerable Pūrṇa, the superintendent, replied to the master builder,

source: ཁྱིམ་བདག་ཁང་བཟངས་ཙན་དན་གྱི་ཁྱམས་དང་ལྡན་པ་དེ།
en: “Householder, [no other ascetic or brahmin would be able to make use of] this temple with its sandalwood courtyard,

source: བཅོམ་ལྡན་འདས་ཁོ་ནའི་ཕྱིར་བྱས།
en: which has been built exclusively for the Blessed One,

source: བཅོམ་ལྡན་འདས་ཁོ་ནའི་ཆེད་དུ་བྱས་པ་འདི།
en: exclusively for the sake of the Blessed One.

source: དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་གང་གིས་ཀྱང་ལོངས་སྤྱད་པར་ནུས་པ་མེད་དོ། །
en: no other ascetic or brahmin would be able to make use of this temple

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: And why?

source: ཁྱིམ་བདག་དེ་བཞིན་གཤེགས་པའི་ལྷུང་བཟེད་དམ། ཆོས་གོས་སམ། གདིང་བའམ། བགོ་བའམ། ཀུན་དགའ་ར་བའམ། འཆག་སའམ། སྟན་ནམ། གཙུག་ལག་ཁང་དེ་དག་ནི་ལྷ་དང་བཅས་པ་དང་། བདུད་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མིར་བཅས་པའི་མཆོད་རྟེན་དུ་གྱུར་པ་ཡིན་ཏེ
en: Householder, because the Blessed One’s offering bowl, robes, sitting mat, clothing, park, walkway, seat, and dwelling place are objects venerated by gods and men, including divine beings, demons, Brahmā, ascetics, and brahmins.

source: དེ་ནི་གཞན་སུས་ཀྱང་ལོངས་སྤྱོད་པར་མི་ནུས་སོ། །
en: No one else can use them.

source: ཡོན་ཏན་དེ་ལྟ་བུ་དང་ལྡན་པའི་དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་དེ་གང་ཡང་མེད་དེ།
en: Because no ascetic or brahmin has such qualities.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཅི་འདྲ་བ་དེ་ལྟ་བུ་དང་ལྡན་པའི་དགེ་སྦྱོང་ངམ་བྲམ་ཟེ་དེ་གང་ཡང་མེད་དོ། །
en: There is no ascetic or brahmin who has comparable qualities to the Blessed One, the thus-gone, worthy, perfect Buddha.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ནི་ཡོན་ཏན་ཚད་མེད་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: His qualities are limitless.

source: ཁྱིམ་བདག་བཅོམ་ལྡན་འདས་དེ་ནི་ཡོན་ཏན་གྲངས་མེད་པ་དང་ལྡན།
en: Householder, the Blessed One has countless qualities,

source: ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན།
en: inconceivable qualities,

source: ཡོན་ཏན་གཞལ་དུ་མེད་པ་དང་ལྡན།
en: incomparable qualities,

source: ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན།
en: boundless qualities,

source: ཡོན་ཏན་བརྗོད་ཀྱིས་མི་ལང་བ་དང་ལྡན་པའོ། །
en: and inexpressible qualities.

source: ཁྱིམ་བདག་བཅོམ་ལྡན་འདས་དེ་ནི་མཁྱེན་པ་ཚད་མེད་པ་དང་ལྡན།
en: Householder, the Blessed One has limitless knowledge,

source: མཁྱེན་པ་གྲངས་མེད་པ་དང་ལྡན།
en: infinite knowledge,

source: མཁྱེན་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན།
en: inconceivable knowledge,

source: མཁྱེན་པ་གཞལ་དུ་མེད་པ་དང་ལྡན།
en: incomparable knowledge,

source: མཁྱེན་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན།
en: boundless knowledge,

source: མཁྱེན་པ་བརྗོད་ཀྱིས་མི་ལང་བ་དང་ལྡན་པའོ། །
en: and inexpressible knowledge.

source: ཁྱིམ་བདག་དེ་བཞིན་གཤེགས་པ་དེ་ནི་གནས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of what is possible.

source: གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the knowledge of the origin as related to knowledge of what is possible.

source: གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the knowledge of cessation as related to knowledge of what is possible.

source: གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the path that leads to cessation as related to knowledge of what is possible.

source: གནས་མ་ཡིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of what is impossible.

source: གནས་མ་ཡིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of what is impossible. He correctly understands the knowledge of cessation as related to knowledge of what is impossible. He correctly understands the knowledge of the path that leads to cessation as related to knowledge of what is impossible.

source: འདས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the past.

source: འདས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འདས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། འདས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the past, the knowledge of cessation as related to knowledge of the past, and the knowledge of the path that leads to cessation as related to knowledge of the past.

source: མ་འོངས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the future.

source: མ་འོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། མ་འོངས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། མ་འོངས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the future, the knowledge of cessation as related to knowledge of the future, and the knowledge of the path that leads to cessation as related to knowledge of the future.

source: ད་ལྟར་བྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the present.

source: ད་ལྟར་བྱུང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the knowledge of the origin as related to knowledge of the present.

source: ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the knowledge of cessation as related to knowledge of the present.

source: ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the path that leads to cessation as related to knowledge of the present.

source: ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of karma.

source: ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན།
en: He correctly understands the knowledge of the origin as related to knowledge of karma, the knowledge of cessation as related to knowledge of karma,

source: ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands [the knowledge of the origin as related to knowledge of karma, the knowledge of cessation as related to knowledge of karma, and] the knowledge of the path that leads to cessation as related to knowledge of karma.

source: ཡང་དག་པར་བླང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of adopted actions.

source: ཡང་དག་པར་བླང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཡང་དག་པར་བླང་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཡང་དག་པར་བླང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of adopted actions, the knowledge of cessation as related to knowledge of adopted actions, and the knowledge of the path that leads to cessation as related to knowledge of adopted actions.

source: གནས་ཀྱི་བསམ་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the contemplations of abodes.

source: གནས་ཀྱི་བསམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། གནས་ཀྱི་བསམ་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། གནས་ཀྱི་བསམ་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the contemplations of abodes, the knowledge of cessation as related to knowledge of the contemplations of abodes, and the knowledge of the path that leads to cessation as related to knowledge of the contemplations of abodes.

source: རྒྱུའི་བསམ་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the contemplations of causes.

source: རྒྱུའི་བསམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རྒྱུའི་བསམ་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། རྒྱུའི་བསམ་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the contemplations of causes, the knowledge of cessation as related to knowledge of the contemplations of causes, and the knowledge of the path that leads to cessation as related to knowledge of the contemplations of causes.

source: རྣམ་པར་སྨིན་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of ripening.

source: རྣམ་པར་སྨིན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། རྣམ་པར་སྨིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of ripening, the knowledge of cessation as related to knowledge of ripening, and the knowledge of the path that leads to cessation as related to knowledge of ripening.

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the paths that lead to all destinations.

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the paths that lead to all destinations, the knowledge of cessation as related to knowledge of the paths that lead to all destinations, and the knowledge of the path that leads to cessation as related to knowledge of the paths that lead to all destinations.

source: ཁམས་དུ་མ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the several elements.

source: ཁམས་དུ་མ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཁམས་དུ་མ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཁམས་དུ་མ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the several elements, the knowledge of cessation as related to knowledge of the several elements, and the knowledge of the path that leads to cessation as related to knowledge of the several elements.

source: ཁམས་སྣ་ཚོགས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the various elements.

source: ཁམས་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཁམས་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཁམས་སྣ་ཚོགས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the various elements, the knowledge of cessation as related to knowledge of the various elements, and the knowledge of the path that leads to cessation as related to knowledge of the various elements.

source: འཇིག་རྟེན་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the world.

source: འཇིག་རྟེན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། འཇིག་རྟེན་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། འཇིག་རྟེན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the world, the knowledge of cessation as related to knowledge of the world, and the knowledge of the path that leads to cessation as related to knowledge of the world.

source: མོས་པ་དུ་མ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of several inclinations.

source: མོས་པ་དུ་མ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། མོས་པ་དུ་མ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། མོས་པ་དུ་མ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of several inclinations, the knowledge of cessation as related to knowledge of several inclinations, and the knowledge of the path that leads to cessation as related to knowledge of several inclinations.

source: མོས་པ་སྣ་ཚོགས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of various inclinations.

source: མོས་པ་སྣ་ཚོགས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། མོས་པ་སྣ་ཚོགས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of various inclinations, the knowledge of cessation as related to knowledge of various inclinations, and the knowledge of the path that leads to cessation as related to knowledge of various inclinations.

source: དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the faculties.

source: དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the faculties, the knowledge of cessation as related to knowledge of the faculties, and the knowledge of the path that leads to cessation as related to knowledge of the faculties.

source: སྟོབས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the powers.

source: སྟོབས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སྟོབས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སྟོབས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the powers, the knowledge of cessation as related to knowledge of the powers, and the knowledge of the path that leads to cessation as related to knowledge of the powers.

source: བརྩོན་འགྲུས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of diligence.

source: བརྩོན་འགྲུས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། བརྩོན་འགྲུས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། བརྩོན་འགྲུས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of diligence, the knowledge of cessation as related to knowledge of diligence, and the knowledge of the path that leads to cessation as related to knowledge of diligence.

source: རིམ་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the levels.

source: རིམ་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རིམ་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། རིམ་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the levels, the knowledge of cessation as related to knowledge of the levels, and the knowledge of the path that leads to cessation as related to knowledge of the levels.

source: བསམ་གཏན་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of concentration.

source: བསམ་གཏན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། བསམ་གཏན་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། བསམ་གཏན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of concentration, the knowledge of cessation as related to knowledge of concentration, and the knowledge of the path that leads to cessation as related to knowledge of concentration.

source: རྣམ་པར་ཐར་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of liberation.

source: རྣམ་པར་ཐར་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རྣམ་པར་ཐར་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། རྣམ་པར་ཐར་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of liberation, the knowledge of cessation as related to knowledge of liberation, and the knowledge of the path that leads to cessation as related to knowledge of liberation.

source: ཏིང་ངེ་འཛིན་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of absorption.

source: ཏིང་ངེ་འཛིན་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of absorption, the knowledge of cessation as related to knowledge of absorption, and the knowledge of the path that leads to cessation as related to knowledge of absorption.

source: སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of equilibrium.

source: སྙོམས་པར་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སྙོམས་པར་འཇུག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of equilibrium, the knowledge of cessation as related to knowledge of equilibrium, and the knowledge of the path that leads to cessation as related to knowledge of equilibrium.

source: ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of affliction.

source: ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of affliction, the knowledge of cessation as related to knowledge of affliction, and the knowledge of the path that leads to cessation as related to knowledge of affliction.

source: རྣམ་པར་བྱང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of purification.

source: རྣམ་པར་བྱང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རྣམ་པར་བྱང་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། རྣམ་པར་བྱང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of purification, the knowledge of cessation as related to knowledge of purification, and the knowledge of the path that leads to cessation as related to knowledge of purification.

source: རྣམ་པར་གཞག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of abiding.

source: རྣམ་པར་གཞག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། རྣམ་པར་གཞག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། རྣམ་པར་གཞག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of abiding, the knowledge of cessation as related to knowledge of abiding, and the knowledge of the path that leads to cessation as related to knowledge of abiding.

source: སྔོན་གྱི་མཐའ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the past.

source: སྔོན་གྱི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སྔོན་གྱི་མཐའ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སྔོན་གྱི་མཐའ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the past, the knowledge of cessation as related to knowledge of the past, and the knowledge of the path that leads to cessation as related to knowledge of the past.

source: སྔོན་གྱི་གནས་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of past existences.

source: སྔོན་གྱི་གནས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། སྔོན་གྱི་གནས་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། སྔོན་གྱི་གནས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of past existences, the knowledge of cessation as related to knowledge of past existences, and the knowledge of the path that leads to cessation as related to knowledge of past existences.

source: ཕྱི་མའི་མཐའ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the future.

source: ཕྱི་མའི་མཐའ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ཕྱི་མའི་མཐའ་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ཕྱི་མའི་མཐའ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the future, the knowledge of cessation as related to knowledge of the future, and the knowledge of the path that leads to cessation as related to knowledge of the future.

source: ལྷའི་མིག་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of the divine eye.

source: ལྷའི་མིག་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དང་། ལྷའི་མིག་ཤེས་པ་འགོག་པ་ཤེས་པ་དང་། ལྷའི་མིག་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of the origin as related to knowledge of the divine eye, the knowledge of cessation as related to knowledge of the divine eye, and the knowledge of the path that leads to cessation as related to knowledge of the divine eye.

source: འཆི་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: “He correctly understands the knowledge of death.
